{
	"if2121": "Perdalam materi <b>logika relasional</b> dan persiapkan diri untuk soal-soal analisis. Materi <b>logika proposisi</b> dapat diabaikan pada saat UAS, karena tidak pernah keluar. <b>Prolog</b> hampir pasti keluar pada saat UAS, dan selalu lebih dari satu soal.",
	"if2122": "Perdalam materi <b>probabilitas</b> untuk UTS, karena hampir semua soal UTS menggunakan materi ini. Pastikan dirimu untuk memahami materi <b>statistika</b> untuk UTS (materi parameter populasi) dan UAS (materi parameter populasi dan pengecekan hipotesis), karena selalu digunakan pada saat kedua ujian.",
	"if2120": "Distribusi setiap materi untuk UTS dan UAS pada mata kuliah ini cenderung sama untuk setiap tahun. Untuk UTS, disarankan untuk memperdalam materi <b>himpunan</b> dan <b>teori bilangan</b>. Untuk UAS, perdalam materi <b>teori graf dan pohon</b> dan <b>kompleksitas algoritma</b>.",
	"if2130": "Soal teori lebih sering muncul pada soal tahun-tahun lama. Namun, pada dua tahun terakhir, <b>soal analisis</b> mulai sering muncul. Perdalam materi </b>assembly</b>, pahami teori mengenai <b>konsep dasar</b>, <b>memory</b>, dan <b>caching</b>.",
	"if2240": "Untuk UTS, soal untuk materi <b>transformasi model data (ERD -> relasional)</b> dan <b>entity-relationship diagram</b> hampir selalu keluar dan selalu bertipe analisis. Selain itu, kemungkinan besar soalnya bertipe teori. Perdalam materi <b>SQL</b> dan <b>desain basis data relasional</b> untuk UAS, karena selalu keluar.",
	"if2250": "Soal UTS pada tahun-tahun lama cenderung menggabungkan soal <b>teori</b> dan <b>analisis</b> untuk beberapa materi. Namun, pada dua tahun terakhir, semua soal UTS cenderung bertipe <b>analisis</b>. Soal UAS hingga saat ini masih cenderung menggabungkan soal <b>teori</b> dan <b>analisis</b>. Untuk UAS, perdalam materi <b>pembangunan perangkat lunak berorientasi objek</b>, karena memiliki jumlah soal paling banyak.",
	"if2230": "Materi <b>proses dan IPC</b> hampir pasti keluar di setiap UAS/UTS, sedangkan materi <b>memori dan paging</b> pasti keluar dalam bentuk analisis. Hafalkan <b>konsep dasar</b> karena pasti akan ditanyakan di setiap UTS dalam bentuk <b>teori</b>.",
	"if2220": "Perdalam materi <b>konversi otomata</b> (DFA ke NFA, CFG ke PDA, dst.), dan siapkan diri untuk <b>soal analisis</b>. Materi yang sering muncul pada UTS adalah <b>DFA</b>, sedangkan materi yang paling sering muncul pada UAS adalah <b>CFG</b>.",
	"if2211": "Materi UTS dan UAS <b>hampir selalu sama</b> di setiap tahun dan hampir selalu berbentuk <b>analisis</b>. Persiapkan diri untuk menjawab persoalan dengan perlahan dan teliti. Materi <b>backtracking</b> cukup lama tidak keluar selama beberapa tahun terakhir.",
	"if3170": "Materi dari <b>konsep dasar sampai rule-based system</b> hampir selalu keluar baik pada UTS dan UAS. Pembagian jenis soal <b>teori dan analisis</b> cukup berimbang untuk kedua ujian, sehingga persiapkan diri untuk menjawab keduanya. Untuk UAS, perdalam materi <b>learning system</b>, karena memiliki frekuensi soal paling banyak."
}